In [1]:
from IPython.display import display, HTML
display(HTML("""
<style>
div.container{width:90% !important;}
div.cell.code_cell.rendered{width:100%;}
div.input_prompt{padding:0px;}
div.CodeMirror {font-family:Consolas; font-size:12pt;}
div.text_cell_render.rendered_html{font-size:12pt;}
div.output {font-size:12pt; font-weight:bold;}
div.input {font-family:Consolas; font-size:12pt;}
div.prompt {min-width:70px;}
div#toc-wrapper{padding-top:120px;}
div.text_cell_render ul li{font-size:12pt;padding:5px;}
table.dataframe{font-size:12px;}
</style>
"""))

# 패키지 로드

In [1]:
import pandas as pd
import numpy as np

In [ ]:
from dotenv import load_dotenv
import os
import requests
from bs4 import BeautifulSoup
from urllib.request import url

# 데이터 백업

## 카페 매출

In [22]:
sw_pd.to_csv('c:/Users/Admin/AI/downloads/카드소비데이터 수원시/수원시팔달구열처리백업.csv', index=False)

In [3]:
sw_pd = pd.read_csv('c:/Users/Admin/AI/downloads/카드소비데이터 수원시/수원시팔달구열처리백업.csv')
sw_pd.head(1)

      기준년월일     행정동코드  시간대 성별  연령별  요일   매출금액  매출건수
0  20230101  41115650    1  F    6   7  14393     2

In [25]:
sw_pd_gender_sum.to_csv('c:/Users/Admin/AI/downloads/카드소비데이터 수원시/수원시팔달구성별합백업.csv', index=False)

In [23]:
sw_pd_gender_sum = pd.read_csv('c:/Users/Admin/AI/downloads/카드소비데이터 수원시/수원시팔달구성별합백업.csv')
sw_pd_gender_sum.head(1)

      기준년월일     행정동코드  시간대  연령별  요일   매출금액  매출건수
0  20230101  41115650    1    2   7  17678     2

In [212]:
sw_pd_df.to_csv('c:/Users/Admin/AI/downloads/카드소비데이터 수원시/수원시팔달구행정동명백업.csv', index=False)

In [35]:
sw_pd_df = pd.read_csv('c:/Users/Admin/AI/downloads/카드소비데이터 수원시/수원시팔달구행정동명백업.csv')
sw_pd_df.head(1)

      기준년월일  시간대  연령별  요일   매출금액  매출건수 행정동명
0  20230101    1    2   7  17678     2  매교동

## 행정동 코드

In [13]:
code_sw_pd.to_csv('../data/행정동코드백업.csv', index=False)

In [7]:
code_sw_pd = pd.read_csv('../data/행정동코드백업.csv')
code_sw_pd.head(1)

      행정동코드  시도명     시군구명 읍면동명      생성일자  말소일자
0  41115650  경기도  수원시 팔달구  매교동  20031124   NaN

## 기상청

In [199]:
sw_rainfall.to_csv('c:/Users/Admin/AI/downloads/카드소비데이터 수원시/행궁동 강수량 백업.csv', index=False)

In [193]:
sw_rainfall = pd.read_csv('c:/Users/Admin/AI/downloads/카드소비데이터 수원시/행궁동 강수량 백업.csv')
sw_rainfall.head(1)

     hour  rainfall      date
0  1000.0       0.1  20230106

In [204]:
sw_rainfall_group.to_csv('c:/Users/Admin/AI/downloads/카드소비데이터 수원시/행궁동 강수량 시간대별 백업.csv', index=False)

In [205]:
sw_rainfall_group = pd.read_csv('c:/Users/Admin/AI/downloads/카드소비데이터 수원시/행궁동 강수량 시간대별 백업.csv')
sw_rainfall_group.head(1)

      기준년월일  시간대  강수량
0  20230106    3  0.1

In [224]:
sw_temp_group.to_csv('c:/Users/Admin/AI/downloads/카드소비데이터 수원시/행궁동 기온 시간대별 백업.csv', index=False)

In [2]:
sw_temp_group = pd.read_csv('c:/Users/Admin/AI/downloads/카드소비데이터 수원시/행궁동 기온 시간대별 백업.csv')
sw_temp_group.head(1)

      기준년월일  시간대   기온
0  20230101    1  2.1

## 종합

In [23]:
sw_data_sum.to_csv('c:/Users/Admin/AI/downloads/카드소비데이터 수원시/SUWON_S_DATA_TABLE_GENDER_SUM.csv', index=False)

In [30]:
sw_data_sum = pd.read_csv('c:/Users/Admin/AI/downloads/카드소비데이터 수원시/SUWON_S_DATA_TABLE_GENDER_SUM.csv')

# 수원시 카페 데이터(23-25)

In [87]:
df = [pd.read_csv(f'c:/Users/Admin/AI/downloads/카드소비데이터 수원시/tbsh_gyeonggi_day_20230{i}_수원시.csv') for i in range(1,10)]
df_23_1 = pd.concat(df, ignore_index=True)
df_23_1.head(1)

,ta_ymd,cty_rgn_no,admi_cty_no,card_tpbuz_cd,card_tpbuz_nm_1,card_tpbuz_nm_2,hour,sex,age,day,amt,cnt
0,20230101,41111,41111560,D02,소매/유통,건강/기호식품,5,F,5,7,99502,2

In [88]:
df = [pd.read_csv(f'c:/Users/Admin/AI/downloads/카드소비데이터 수원시/tbsh_gyeonggi_day_2023{i}_수원시.csv') for i in range(10,13)]
df_23_2 = pd.concat(df, ignore_index=True)
df_23_2.head(1)

,ta_ymd,cty_rgn_no,admi_cty_no,card_tpbuz_cd,card_tpbuz_nm_1,card_tpbuz_nm_2,hour,sex,age,day,amt,cnt
0,20231001,41111,41111560,D02,소매/유통,건강/기호식품,3,M,7,7,99502,2

In [89]:
df_23_1 = df_23_1[df_23_1['card_tpbuz_nm_2']=='커피/음료']
df_23_2 = df_23_2[df_23_2['card_tpbuz_nm_2']=='커피/음료']
df_23 = pd.concat([df_23_1, df_23_2]).reset_index(drop=True)
df_23.head(2)

,ta_ymd,cty_rgn_no,admi_cty_no,card_tpbuz_cd,card_tpbuz_nm_1,card_tpbuz_nm_2,hour,sex,age,day,amt,cnt
0,20230101,41111,41111560,Q13,음식,커피/음료,1,F,3,7,259309,2
1,20230101,41111,41111560,Q13,음식,커피/음료,1,M,3,7,62359,9

In [90]:
df = [pd.read_csv(f'c:/Users/Admin/AI/downloads/카드소비데이터 수원시/tbsh_gyeonggi_day_20240{i}_수원시.csv') for i in range(1,10)]
df_24_1 = pd.concat(df, ignore_index=True)
df_24_1.head(1)

,ta_ymd,cty_rgn_no,admi_cty_no,card_tpbuz_cd,card_tpbuz_nm_1,card_tpbuz_nm_2,hour,sex,age,day,amt,cnt
0,20240101,41111,41111560,D02,소매/유통,건강/기호식품,4,F,7,1,32339,3

In [91]:
df = [pd.read_csv(f'c:/Users/Admin/AI/downloads/카드소비데이터 수원시/tbsh_gyeonggi_day_2024{i}_수원시.csv') for i in range(10,12)]
df_24_2 = pd.concat(df, ignore_index=True)
df_24_2.head(1)

,ta_ymd,cty_rgn_no,admi_cty_no,card_tpbuz_cd,card_tpbuz_nm_1,card_tpbuz_nm_2,hour,sex,age,day,amt,cnt
0,20241001,41111,41111560,D01,소매/유통,가전제품,4,M,5,2,167558,2

In [92]:
df_24_3 = pd.read_csv(f'c:/Users/Admin/AI/downloads/카드소비데이터 수원시/tbsh_gyeonggi_day_202412_수원시.csv', encoding='cp949') 
df_24_3.head(1)

,ta_ymd,cty_rgn_no,admi_cty_no,card_tpbuz_cd,card_tpbuz_nm_1,card_tpbuz_nm_2,hour,sex,age,day,amt,cnt
0,20241201,41111,41111560,D02,소매/유통,건강/기호식품,3,M,3,7,181077,5

In [93]:
df_24_1 = df_24_1[df_24_1['card_tpbuz_nm_2']=='커피/음료']
df_24_2 = df_24_2[df_24_2['card_tpbuz_nm_2']=='커피/음료']
df_24_3 = df_24_3[df_24_3['card_tpbuz_nm_2']=='커피/음료']
df_24 = pd.concat([df_24_1, df_24_2, df_24_3]).reset_index(drop=True)
df_24.head(1)

,ta_ymd,cty_rgn_no,admi_cty_no,card_tpbuz_cd,card_tpbuz_nm_1,card_tpbuz_nm_2,hour,sex,age,day,amt,cnt
0,20240101,41111,41111560,Q13,음식,커피/음료,1,F,3,1,15019,5

In [94]:
df = [pd.read_csv(f'c:/Users/Admin/AI/downloads/카드소비데이터 수원시/tbsh_gyeonggi_day_20250{i}_수원시.csv') for i in range(1,10)]
df_25_1 = pd.concat(df, ignore_index=True)
df_25_1.head(1)

,ta_ymd,cty_rgn_no,admi_cty_no,card_tpbuz_cd,card_tpbuz_nm_1,card_tpbuz_nm_2,hour,sex,age,day,amt,cnt
0,20250101,41111,41111560,D02,소매/유통,건강/기호식품,3,M,4,3,144301,2

In [95]:
df_25_2 = pd.read_csv(f'c:/Users/Admin/AI/downloads/카드소비데이터 수원시/tbsh_gyeonggi_day_202510_수원시.csv')
df_25_2.head(1)

,ta_ymd,cty_rgn_no,admi_cty_no,card_tpbuz_cd,card_tpbuz_nm_1,card_tpbuz_nm_2,hour,sex,age,day,amt,cnt
0,20251001,41111,41111560,D01,소매/유통,가전제품,3,F,6,3,379702,2

In [96]:
df_25_1 = df_25_1[df_25_1['card_tpbuz_nm_2']=='커피/음료']
df_25_2 = df_25_2[df_25_2['card_tpbuz_nm_2']=='커피/음료']
df_25 = pd.concat([df_25_1, df_25_2]).reset_index(drop=True)
df_25.head(1)

,ta_ymd,cty_rgn_no,admi_cty_no,card_tpbuz_cd,card_tpbuz_nm_1,card_tpbuz_nm_2,hour,sex,age,day,amt,cnt
0,20250101,41111,41111560,Q13,음식,커피/음료,1,F,3,3,43023,3

In [15]:
df_23.shape, df_24.shape, df_25.shape

((1558156, 12), (1609414, 12), (1354069, 12))

In [97]:
df_23_25 = pd.concat([df_23, df_24, df_25]).reset_index(drop=True)
df_23_25

,ta_ymd,cty_rgn_no,admi_cty_no,card_tpbuz_cd,card_tpbuz_nm_1,card_tpbuz_nm_2,hour,sex,age,day,amt,cnt
0,20230101,41111,41111560,Q13,음식,커피/음료,1,F,3,7,259309,2
1,20230101,41111,41111560,Q13,음식,커피/음료,1,M,3,7,62359,9
2,20230101,41111,41111560,Q13,음식,커피/음료,1,M,4,7,7822,2
3,20230101,41111,41111560,Q13,음식,커피/음료,1,M,5,7,23780,3
4,20230101,41111,41111560,Q13,음식,커피/음료,1,M,7,7,3755,2
...,...,...,...,...,...,...,...,...,...,...,...,...
4521634,20251031,41117,41117610,Q13,음식,커피/음료,10,F,5,5,91990,2
4521635,20251031,41117,41117610,Q13,음식,커피/음료,10,M,3,5,25344,6
4521636,20251031,41117,41117610,Q13,음식,커피/음료,10,M,4,5,2085,2
4521637,20251031,41117,41117610,Q13,음식,커피/음료,10,M,5,5,81039,2
4521638,20251031,41117,41117610,Q13,음식,커피/음료,10,M,6,5,6884,2

In [101]:
df_23_25[df_23_25['amt']==0]

,ta_ymd,cty_rgn_no,admi_cty_no,card_tpbuz_cd,card_tpbuz_nm_1,card_tpbuz_nm_2,hour,sex,age,day,amt,cnt
386402,20230406,41117,41117530,Q13,음식,커피/음료,1,F,8,4,0,2
1581566,20240106,41115,41115680,Q13,음식,커피/음료,9,M,7,6,0,0
1591132,20240108,41117,41117596,Q13,음식,커피/음료,2,F,7,1,0,0
1612246,20240113,41117,41117596,Q13,음식,커피/음료,9,F,7,6,0,0
1623581,20240116,41117,41117510,Q13,음식,커피/음료,2,F,6,2,0,0
1652198,20240123,41115,41115720,Q13,음식,커피/음료,3,F,9,2,0,0
1661377,20240125,41117,41117585,Q13,음식,커피/음료,7,F,8,4,0,0
1681265,20240130,41115,41115710,Q13,음식,커피/음료,2,M,8,2,0,0
1682623,20240130,41117,41117596,Q13,음식,커피/음료,9,F,7,2,0,0
1755988,20240217,41113,41113680,Q13,음식,커피/음료,4,M,8,6,0,0
1889391,20240319,41117,41117570,Q13,음식,커피/음료,5,F,8,2,0,3
2805863,20241008,41117,41117585,Q13,음식,커피/음료,2,F,7,2,0,2

## 행정동 데이터

In [12]:
code_all = pd.read_excel('../data/행정동코드.xlsx')
code_sw_pd = code_all[code_all['시군구명']=='수원시 팔달구'].reset_index(drop=True)
code_sw_pd = code_sw_pd.drop(0).reset_index(drop=True)
code_sw_pd = code_sw_pd.drop(['생성일자', '말소일자'], axis=1)
code_sw_pd['행정동코드'] = code_sw_pd['행정동코드']//100
code_sw_pd

      행정동코드  시도명     시군구명  읍면동명
0  41115650  경기도  수원시 팔달구   매교동
1  41115660  경기도  수원시 팔달구   매산동
2  41115670  경기도  수원시 팔달구   고등동
3  41115680  경기도  수원시 팔달구  화서1동
4  41115690  경기도  수원시 팔달구  화서2동
5  41115700  경기도  수원시 팔달구    지동
6  41115710  경기도  수원시 팔달구  우만1동
7  41115720  경기도  수원시 팔달구  우만2동
8  41115730  경기도  수원시 팔달구   인계동
9  41115740  경기도  수원시 팔달구   행궁동

In [5]:
code_sw_pd_num = code_sw_pd['행정동코드'].to_list()
code_sw_pd_num

[41115650,
 41115660,
 41115670,
 41115680,
 41115690,
 41115700,
 41115710,
 41115720,
 41115730,
 41115740]

## 수원 팔달구 데이터

In [19]:
sw_pd = df_23_25[df_23_25['admi_cty_no'].isin(code_sw_pd_num)]
sw_pd = sw_pd.reset_index(drop=True)
sw_pd

,ta_ymd,cty_rgn_no,admi_cty_no,card_tpbuz_cd,card_tpbuz_nm_1,card_tpbuz_nm_2,hour,sex,age,day,amt,cnt
0,20230101,41115,41115650,Q13,음식,커피/음료,1,F,6,7,14393,2
1,20230101,41115,41115650,Q13,음식,커피/음료,1,M,2,7,17678,2
2,20230101,41115,41115650,Q13,음식,커피/음료,1,M,3,7,17215,9
3,20230101,41115,41115650,Q13,음식,커피/음료,1,M,4,7,22685,6
4,20230101,41115,41115650,Q13,음식,커피/음료,1,M,5,7,23689,5
...,...,...,...,...,...,...,...,...,...,...,...,...
977156,20251031,41115,41115740,Q13,음식,커피/음료,9,M,7,5,31289,2
977157,20251031,41115,41115740,Q13,음식,커피/음료,10,F,3,5,78185,8
977158,20251031,41115,41115740,Q13,음식,커피/음료,10,F,4,5,1564,2
977159,20251031,41115,41115740,Q13,음식,커피/음료,10,F,6,5,105867,2
977160,20251031,41115,41115740,Q13,음식,커피/음료,10,M,4,5,75720,8

In [20]:
not_use = ['cty_rgn_no', 'card_tpbuz_cd', 'card_tpbuz_nm_1', 'card_tpbuz_nm_2']
sw_pd.drop(not_use, axis=1, inplace=True)
sw_pd

          ta_ymd  admi_cty_no  hour sex  age  day     amt  cnt
0       20230101     41115650     1   F    6    7   14393    2
1       20230101     41115650     1   M    2    7   17678    2
2       20230101     41115650     1   M    3    7   17215    9
3       20230101     41115650     1   M    4    7   22685    6
4       20230101     41115650     1   M    5    7   23689    5
...          ...          ...   ...  ..  ...  ...     ...  ...
977156  20251031     41115740     9   M    7    5   31289    2
977157  20251031     41115740    10   F    3    5   78185    8
977158  20251031     41115740    10   F    4    5    1564    2
977159  20251031     41115740    10   F    6    5  105867    2
977160  20251031     41115740    10   M    4    5   75720    8

[977161 rows x 8 columns]

In [5]:
sw_pd.columns = ['기준년월일', '행정동코드', '시간대', '성별', '연령별', '요일', '매출금액', '매출건수']
sw_pd.head(10)

      기준년월일     행정동코드  시간대 성별  연령별  요일   매출금액  매출건수
0  20230101  41115650    1  F    6   7  14393     2
1  20230101  41115650    1  M    2   7  17678     2
2  20230101  41115650    1  M    3   7  17215     9
3  20230101  41115650    1  M    4   7  22685     6
4  20230101  41115650    1  M    5   7  23689     5
5  20230101  41115650    1  M    6   7   5945     2
6  20230101  41115650    2  F    3   7   8917     2
7  20230101  41115650    2  M    4   7   5006     2
8  20230101  41115650    2  M    5   7  13924     2
9  20230101  41115650    2  M    6   7   7666     2

In [6]:
sw_pd_gender_sum = (sw_pd.groupby(['기준년월일', '행정동코드', '시간대', '연령별', '요일'], as_index=False)[['매출금액','매출건수']].sum())
sw_pd_gender_sum.head(10)

      기준년월일     행정동코드  시간대  연령별  요일    매출금액  매출건수
0  20230101  41115650    1    2   7   17678     2
1  20230101  41115650    1    3   7   17215     9
2  20230101  41115650    1    4   7   22685     6
3  20230101  41115650    1    5   7   23689     5
4  20230101  41115650    1    6   7   20338     4
5  20230101  41115650    2    3   7    8917     2
6  20230101  41115650    2    4   7    5006     2
7  20230101  41115650    2    5   7   13924     2
8  20230101  41115650    2    6   7    7666     2
9  20230101  41115650    3    4   7  146089    17

## 팔달구 데이터+행정동코드

In [78]:
code_name = code_sw_pd.set_index('행정동코드')['읍면동명']
code_name

행정동코드
41115650     매교동
41115660     매산동
41115670     고등동
41115680    화서1동
41115690    화서2동
41115700      지동
41115710    우만1동
41115720    우만2동
41115730     인계동
41115740     행궁동
Name: 읍면동명, dtype: object

In [33]:
sw_pd_gender_sum['행정동명'] = sw_pd_gender_sum['행정동코드'].map(code_name)
sw_pd_df = sw_pd_gender_sum.drop('행정동코드', axis=1)
sw_pd_df

           기준년월일  시간대  연령별  요일    매출금액  매출건수 행정동명
0       20230101    1    2   7   17678     2  매교동
1       20230101    1    3   7   17215     9  매교동
2       20230101    1    4   7   22685     6  매교동
3       20230101    1    5   7   23689     5  매교동
4       20230101    1    6   7   20338     4  매교동
...          ...  ...  ...  ..     ...   ...  ...
559482  20251031    9    6   5  276110    18  행궁동
559483  20251031    9    7   5   84726     7  행궁동
559484  20251031   10    3   5   78185     8  행궁동
559485  20251031   10    4   5   77284    10  행궁동
559486  20251031   10    6   5  105867     2  행궁동

[559487 rows x 7 columns]

In [64]:
sw_pd_df['객단가'] = pd.to_numeric((sw_pd_df['매출금액']/sw_pd_df['매출건수']).round(),errors='coerce').fillna(0).astype('int64')
sw_pd_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 559487 entries, 0 to 559486
Data columns (total 8 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   기준년월일   559487 non-null  int64
 1   시간대     559487 non-null  int64
 2   연령별     559487 non-null  int64
 3   요일      559487 non-null  int64
 4   매출금액    559487 non-null  int64
 5   매출건수    559487 non-null  int64
 6   행정동명    559487 non-null  object
 7   객단가     559487 non-null  int64
dtypes: int64(7), object(1)
memory usage: 34.1+ MB

In [68]:
sw_pd_df[sw_pd_df['매출금액']==0]

           기준년월일  시간대  연령별  요일  매출금액  매출건수  행정동명  객단가
196842  20240106    9    7   6     0     0  화서1동    0
205724  20240123    3    9   2     0     0  우만2동    0

In [86]:
sw_pd_df[sw_pd_df['객단가'].isnull()]

Empty DataFrame
Columns: [기준년월일, 시간대, 연령별, 요일, 매출금액, 매출건수, 행정동명, 객단가]
Index: []

In [71]:
sw_pd_df.drop([196842,205724], inplace=True)

           기준년월일  시간대  연령별  요일   매출금액  매출건수  행정동명   객단가
196841  20240106    9    6   6  15969     4  화서1동  3992
196843  20240106   10    3   6  16584     4  화서1동  4146
196844  20240106   10    4   6  20151     4  화서1동  5038

In [72]:
sw_pd_df = sw_pd_df.reset_index(drop=True)
sw_pd_df.iloc[196841:196843]

           기준년월일  시간대  연령별  요일   매출금액  매출건수  행정동명   객단가
196841  20240106    9    6   6  15969     4  화서1동  3992
196842  20240106   10    3   6  16584     4  화서1동  4146

In [211]:
sw_pd_df = (sw_pd_df.groupby(['기준년월일', '행정동명', '시간대', '요일'], as_index=False)[['연령별','매출금액','매출건수']].sum())
sw_pd_df['객단가'] = pd.to_numeric((sw_pd_df['매출금액']/sw_pd_df['매출건수']).round(),errors='coerce').fillna(0).astype('int64')
sw_pd_df.drop('연령별', axis=1, inplace=True)
sw_pd_df

           기준년월일  행정동명  시간대  요일     매출금액  매출건수    객단가
0       20230101   고등동    1   7    65063     7   9295
1       20230101   고등동    2   7    14878     4   3720
2       20230101   고등동    3   7    77671    20   3884
3       20230101   고등동    4   7   452897    52   8710
4       20230101   고등동    5   7   972179    92  10567
...          ...   ...  ...  ..      ...   ...    ...
101508  20251031  화서2동    6   5   886440   155   5719
101509  20251031  화서2동    7   5  1319747   105  12569
101510  20251031  화서2동    8   5  3662364   125  29299
101511  20251031  화서2동    9   5  1999679    51  39209
101512  20251031  화서2동   10   5    33534    11   3049

[101513 rows x 7 columns]

# 기상청

In [227]:
sw_weather = pd.read_csv('C:/Users/Admin/AI/downloads/카드소비데이터 수원시/수원_기상_20251222142454.csv', encoding='cp949')
sw_weather.drop(['지점', '지점명'], axis=1, inplace=True)
sw_weather

            일시  평균기온(°C)  일강수량(mm)  합계 3시간 신적설(cm)
0   2023-01-01      -2.1       NaN             NaN
1   2023-01-02      -5.6       NaN             NaN
2   2023-01-03      -6.3       NaN             NaN
3   2023-01-04      -3.1       NaN             NaN
4   2023-01-05      -3.6       NaN             NaN
5   2023-01-06      -0.9       5.5             NaN
6   2023-01-07       0.5       0.1             NaN
7   2023-01-08       0.2       NaN             NaN
8   2023-01-09       2.3       NaN             NaN
9   2023-01-10      -0.2       NaN             NaN
10  2023-01-11       0.2       NaN             NaN
11  2023-01-12       4.7       0.1             NaN
12  2023-01-13       7.1      25.2             NaN
13  2023-01-14       4.9       3.7             NaN
14  2023-01-15      -1.5       2.3             0.9
15  2023-01-16      -5.2       0.0             0.0
16  2023-01-17      -3.0       0.0             NaN
17  2023-01-18      -2.1       NaN             NaN
18  2023-01-19      -0.1       0.7             NaN
19  2023-01-20      -2.4       NaN             NaN
20  2023-01-21      -4.0       NaN             NaN
21  2023-01-22      -0.1       NaN             NaN
22  2023-01-23      -0.5       NaN             NaN
23  2023-01-24     -13.4       0.0             NaN
24  2023-01-25     -10.8       NaN             NaN
25  2023-01-26      -5.8       1.3             5.5
26  2023-01-27      -7.3       NaN             NaN
27  2023-01-28      -5.6       0.0             NaN
28  2023-01-29      -1.8       0.0             NaN
29  2023-01-30      -1.3       NaN             NaN
30  2023-01-31       2.1       NaN             NaN

In [107]:
df1 = pd.read_csv('C:/Users/Admin/AI/downloads/카드소비데이터 수원시/SURFACE_ASOS_119_DAY_2023_2023_2024.csv', encoding='cp949')
df1.head(1).T

                              0
지점                          119
일시                   2023-01-01
평균기온(°C)                   -2.1
최저기온(°C)                   -6.6
최저기온 시각(hhmi)               728
최고기온(°C)                    3.5
최고기온 시각(hhmi)              1331
강수 계속시간(hr)                 NaN
10분 최다 강수량(mm)              NaN
10분 최다강수량 시각(hhmi)          NaN
1시간 최다강수량(mm)               NaN
1시간 최다 강수량 시각(hhmi)         NaN
일강수량(mm)                    NaN
최대 순간 풍속(m/s)               7.1
최대 순간 풍속 풍향(16방위)         270.0
최대 순간풍속 시각(hhmi)         1342.0
최대 풍속(m/s)                  4.2
최대 풍속 풍향(16방위)              290
최대 풍속 시각(hhmi)             1428
평균 풍속(m/s)                  1.8
풍정합(100m)                  1587
평균 이슬점온도(°C)               -9.0
최소 상대습도(%)                   35
최소 상대습도 시각(hhmi)           1256
평균 상대습도(%)                 63.1
평균 증기압(hPa)                 3.2
평균 현지기압(hPa)             1026.5
최고 해면기압(hPa)             1033.7
최고 해면기압 시각(hhmi)           2243
최저 해면기압(hPa)             1029.9
최저 해면기압 시각(hhmi)            426
평균 해면기압(hPa)             1031.6
가조시간(hr)                    9.7
합계 일조시간(hr)                 9.0
1시간 최다일사 시각(hhmi)          1200
1시간 최다일사량(MJ/m2)           1.83
합계 일사량(MJ/m2)             11.14
일 최심신적설(cm)                 NaN
일 최심신적설 시각(hhmi)            NaN
일 최심적설(cm)                  NaN
일 최심적설 시각(hhmi)             NaN
합계 3시간 신적설(cm)              NaN
평균 전운량(1/10)                1.5
평균 중하층운량(1/10)              1.3
평균 지면온도(°C)                -1.9
최저 초상온도(°C)               -11.3
평균 5cm 지중온도(°C)             NaN
평균 10cm 지중온도(°C)            NaN
평균 20cm 지중온도(°C)            NaN
평균 30cm 지중온도(°C)            NaN
0.5m 지중온도(°C)               NaN
1.0m 지중온도(°C)               NaN
1.5m 지중온도(°C)               NaN
3.0m 지중온도(°C)               NaN
5.0m 지중온도(°C)               NaN
합계 대형증발량(mm)                1.4
합계 소형증발량(mm)                2.0
9-9강수(mm)                   NaN
안개 계속시간(hr)                 NaN

## 행궁동 강수량

In [179]:
sw_rainfall_1 = pd.read_csv('C:/Users/Admin/AI/downloads/카드소비데이터 수원시/행궁동_강수_202301_202312.csv')
sw_rainfall_2 = pd.read_csv('C:/Users/Admin/AI/downloads/카드소비데이터 수원시/행궁동_강수_202401_202412.csv')
sw_rainfall_3 = pd.read_csv('C:/Users/Admin/AI/downloads/카드소비데이터 수원시/행궁동_강수_202501_202510.csv')

mask = sw_rainfall_1[' format: day'].astype(str).str.contains('Start')
sw_rainfall_1 = sw_rainfall_1[~mask].reset_index(drop=True)
days_2023 = pd.date_range('2023-01-01', '2023-12-31', freq='D')
full_dates = days_2023.repeat(24) 
# print(len(sw_rainfall_1), len(full_dates))
sw_rainfall_1['date'] = full_dates.strftime('%Y%m%d')
sw_rainfall_1.drop(columns=[' format: day'], inplace=True)
sw_rainfall_1.rename(columns={'value location:61_121 Start : 20230101 ': 'rainfall'},inplace=True)


mask = sw_rainfall_2[' format: day'].astype(str).str.contains('Start')
sw_rainfall_2 = sw_rainfall_2[~mask].reset_index(drop=True)
days_2024 = pd.date_range('2024-01-01', '2024-12-31', freq='D')
full_dates = days_2024.repeat(24) 
# print(len(sw_rainfall_2), len(full_dates))
sw_rainfall_2['date'] = full_dates.strftime('%Y%m%d')
sw_rainfall_2.drop(columns=[' format: day'], inplace=True)
sw_rainfall_2.rename(columns={'value location:61_121 Start : 20240101 ': 'rainfall'},inplace=True)


mask = sw_rainfall_3[' format: day'].astype(str).str.contains('Start')
sw_rainfall_3 = sw_rainfall_3[~mask].reset_index(drop=True)
days_2025 = pd.date_range('2025-01-01', '2025-10-31', freq='D')
full_dates = days_2025.repeat(24) 
# print(len(sw_rainfall_3), len(full_dates))
sw_rainfall_3['date'] = full_dates.strftime('%Y%m%d')
sw_rainfall_3.drop(columns=[' format: day'], inplace=True)
sw_rainfall_3.rename(columns={'value location:61_121 Start : 20250101 ': 'rainfall'},inplace=True)

# sw_rainfall_1.shape, sw_rainfall_2.shape, sw_rainfall_3.shape
sw_rainfall_3.iloc[744:746]

      hour  rainfall      date
744    0.0       0.0  20250201
745  100.0       0.0  20250201

In [197]:
sw_rainfall = pd.concat([sw_rainfall_1, sw_rainfall_2, sw_rainfall_3], ignore_index=True)
sw_rainfall = sw_rainfall[sw_rainfall['rainfall'] != 0].reset_index(drop=True)
sw_rainfall

        hour  rainfall      date
0     1000.0       0.1  20230106
1     1100.0       0.8  20230106
2     1200.0       0.1  20230106
3     1300.0       4.2  20230106
4     1400.0       0.3  20230106
...      ...       ...       ...
2043  1200.0       2.2  20251026
2044  1300.0       2.2  20251026
2045  1400.0       0.2  20251031
2046  1500.0       2.4  20251031
2047  1600.0       0.6  20251031

[2048 rows x 3 columns]

In [198]:
h = (sw_rainfall['hour'] // 100).astype(int)

def hour_to_slot(x):
    if   0  <= x <= 6: return 1    # 00:00~06:59
    elif 7  <= x <= 8: return 2    # 07:00~08:59
    elif 9  <= x <= 10:return 3    # 09:00~10:59
    elif 11 <= x <= 12:return 4    # 11:00~12:59
    elif 13 <= x <= 14:return 5    # 13:00~14:59
    elif 15 <= x <= 16:return 6    # 15:00~16:59
    elif 17 <= x <= 18:return 7    # 17:00~18:59
    elif 19 <= x <= 20:return 8    # 19:00~20:59
    elif 21 <= x <= 22:return 9    # 21:00~22:59
    elif x == 23:      return 10   # 23:00~23:59
    else:              return None   

sw_rainfall['time_slot'] = h.map(hour_to_slot)
sw_rainfall.columns = ['시간', '강수량', '기준년월일', '시간대']
sw_rainfall = sw_rainfall[['기준년월일', '시간대', '시간', '강수량']]
sw_rainfall

         기준년월일  시간대      시간  강수량
0     20230106    3  1000.0  0.1
1     20230106    4  1100.0  0.8
2     20230106    4  1200.0  0.1
3     20230106    5  1300.0  4.2
4     20230106    5  1400.0  0.3
...        ...  ...     ...  ...
2043  20251026    4  1200.0  2.2
2044  20251026    5  1300.0  2.2
2045  20251031    5  1400.0  0.2
2046  20251031    6  1500.0  2.4
2047  20251031    6  1600.0  0.6

[2048 rows x 4 columns]

In [203]:
sw_rainfall_group = (sw_rainfall.groupby(['기준년월일', '시간대'], as_index=False)['강수량'].mean())
sw_rainfall_group = sw_rainfall_group[sw_rainfall_group['강수량'] >= 0].reset_index(drop=True)
sw_rainfall_group

         기준년월일  시간대   강수량
0     20230106    3  0.10
1     20230106    4  0.45
2     20230106    5  2.25
3     20230106    8  0.10
4     20230112    5  0.10
...        ...  ...   ...
1113  20251026    1  0.10
1114  20251026    4  2.20
1115  20251026    5  2.20
1116  20251031    5  0.20
1117  20251031    6  1.50

[1118 rows x 3 columns]

## 행궁동 기온

In [218]:
sw_temp_1 = pd.read_csv('C:/Users/Admin/AI/downloads/카드소비데이터 수원시/행궁동_기온_202301_202312.csv')
sw_temp_2 = pd.read_csv('C:/Users/Admin/AI/downloads/카드소비데이터 수원시/행궁동_기온_202401_202412.csv')
sw_temp_3 = pd.read_csv('C:/Users/Admin/AI/downloads/카드소비데이터 수원시/행궁동_기온_202501_202510.csv')

mask = sw_temp_1[' format: day'].astype(str).str.contains('Start')
sw_temp_1 = sw_temp_1[~mask].reset_index(drop=True)
days_2023 = pd.date_range('2023-01-01', '2023-12-31', freq='D')
full_dates = days_2023.repeat(24) 
# print(len(sw_temp_1), len(full_dates))
sw_temp_1['date'] = full_dates.strftime('%Y%m%d')
sw_temp_1.drop(columns=[' format: day'], inplace=True)
sw_temp_1.rename(columns={'value location:61_121 Start : 20230101 ': 'temp'},inplace=True)

mask = sw_temp_2[' format: day'].astype(str).str.contains('Start')
sw_temp_2 = sw_temp_2[~mask].reset_index(drop=True)
days_2024 = pd.date_range('2024-01-01', '2024-12-31', freq='D')
full_dates = days_2024.repeat(24) 
# print(len(sw_rainfall_2), len(full_dates))
sw_temp_2['date'] = full_dates.strftime('%Y%m%d')
sw_temp_2.drop(columns=[' format: day'], inplace=True)
sw_temp_2.rename(columns={'value location:61_121 Start : 20240101 ': 'temp'},inplace=True)

mask = sw_temp_3[' format: day'].astype(str).str.contains('Start')
sw_temp_3 = sw_temp_3[~mask].reset_index(drop=True)
days_2025 = pd.date_range('2025-01-01', '2025-10-31', freq='D')
full_dates = days_2025.repeat(24) 
print(len(sw_rainfall_3), len(full_dates))
sw_temp_3['date'] = full_dates.strftime('%Y%m%d')
sw_temp_3.drop(columns=[' format: day'], inplace=True)
sw_temp_3.rename(columns={'value location:61_121 Start : 20250101 ': 'temp'},inplace=True)

sw_temp_3.iloc[743:746]

7296 7296

       hour  temp      date
743  2300.0   0.0  20250131
744     0.0   1.3  20250201
745   100.0   2.6  20250201

In [219]:
sw_temp = pd.concat([sw_temp_1, sw_temp_2, sw_temp_3], ignore_index=True)
sw_temp

         hour  temp      date
0         0.0   0.1  20230101
1       100.0   1.2  20230101
2       200.0   2.2  20230101
3       300.0   3.2  20230101
4       400.0   3.0  20230101
...       ...   ...       ...
24835  1900.0  11.1  20251031
24836  2000.0  10.3  20251031
24837  2100.0   9.4  20251031
24838  2200.0   9.3  20251031
24839  2300.0  12.0  20251031

[24840 rows x 3 columns]

In [220]:
h = (sw_temp['hour'] // 100).astype(int)

sw_temp['time_slot'] = h.map(hour_to_slot)
sw_temp.columns = ['시간', '기온', '기준년월일', '시간대']
sw_temp = sw_temp[['기준년월일', '시간대', '시간', '기온']]
sw_temp

          기준년월일  시간대      시간    기온
0      20230101    1     0.0   0.1
1      20230101    1   100.0   1.2
2      20230101    1   200.0   2.2
3      20230101    1   300.0   3.2
4      20230101    1   400.0   3.0
...         ...  ...     ...   ...
24835  20251031    8  1900.0  11.1
24836  20251031    8  2000.0  10.3
24837  20251031    9  2100.0   9.4
24838  20251031    9  2200.0   9.3
24839  20251031   10  2300.0  12.0

[24840 rows x 4 columns]

In [223]:
sw_temp_group = (sw_temp.groupby(['기준년월일', '시간대'], as_index=False)['기온'].mean())
sw_temp_group

          기준년월일  시간대     기온
0      20230101    1   2.10
1      20230101    2  -0.20
2      20230101    3  -2.25
3      20230101    4  -3.20
4      20230101    5  -4.10
...         ...  ...    ...
10345  20251031    6  11.65
10346  20251031    7  11.65
10347  20251031    8  10.70
10348  20251031    9   9.35
10349  20251031   10  12.00

[10350 rows x 3 columns]

In [3]:
sw_weather = pd.read_csv('C:/Users/Admin/AI/downloads/카드소비데이터 수원시/SURFACE_ASOS_119_HR_2023_2023_2024.csv', encoding='cp949')
sw_weather.drop(['지점','풍속(m/s)','풍향(16방위)','습도(%)','증기압(hPa)', '이슬점온도(°C)', '현지기압(hPa)', '해면기압(hPa)','전운량(10분위)', '중하층운량(10분위)',
       '운형(운형약어)', '최저운고(100m )', '시정(10m)', '지면상태(지면상태코드)', '현상번호(국내식)',
       '지면온도(°C)', '5cm 지중온도(°C)', '10cm 지중온도(°C)', '20cm 지중온도(°C)',
       '30cm 지중온도(°C)'], inplace=True, axis=1)
sw_weather

                    일시  기온(°C)  강수량(mm)  일조(hr)  일사(MJ/m2)  적설(cm)  3시간신적설(cm)
0     2023-01-01 00:00    -4.6      NaN     NaN        NaN     NaN         NaN
1     2023-01-01 01:00    -4.5      NaN     NaN        NaN     NaN         NaN
2     2023-01-01 02:00    -4.1      NaN     NaN        NaN     NaN         NaN
3     2023-01-01 03:00    -4.4      NaN     NaN        NaN     NaN         NaN
4     2023-01-01 04:00    -4.9      NaN     NaN        NaN     NaN         NaN
...                ...     ...      ...     ...        ...     ...         ...
8755  2023-12-31 19:00     2.1      NaN     NaN        NaN     NaN         NaN
8756  2023-12-31 20:00     1.1      NaN     NaN        NaN     NaN         NaN
8757  2023-12-31 21:00     0.0      NaN     NaN        NaN     NaN         NaN
8758  2023-12-31 22:00    -0.5      NaN     NaN        NaN     NaN         NaN
8759  2023-12-31 23:00    -0.8      NaN     NaN        NaN     NaN         NaN

[8760 rows x 7 columns]

In [26]:
sw_weather.columns

Index(['지점', '일시', '기온(°C)', '강수량(mm)', '풍속(m/s)', '풍향(16방위)', '습도(%)',
       '증기압(hPa)', '이슬점온도(°C)', '현지기압(hPa)', '해면기압(hPa)', '일조(hr)',
       '일사(MJ/m2)', '적설(cm)', '3시간신적설(cm)', '전운량(10분위)', '중하층운량(10분위)',
       '운형(운형약어)', '최저운고(100m )', '시정(10m)', '지면상태(지면상태코드)', '현상번호(국내식)',
       '지면온도(°C)', '5cm 지중온도(°C)', '10cm 지중온도(°C)', '20cm 지중온도(°C)',
       '30cm 지중온도(°C)'],
      dtype='object')

In [37]:
sw_weather[sw_weather['적설(cm)'].notna()]

                    일시  기온(°C)  강수량(mm)  일조(hr)  일사(MJ/m2)  적설(cm)  3시간신적설(cm)
344   2023-01-15 08:00    -0.7      NaN     0.0       0.00     0.1         NaN
345   2023-01-15 09:00    -1.1      0.8     0.0       0.00     0.5         0.5
346   2023-01-15 10:00    -1.2      NaN     0.0       0.00     0.6         NaN
347   2023-01-15 11:00    -1.4      NaN     0.0       0.18     0.8         NaN
348   2023-01-15 12:00    -1.4      0.1     0.0       0.14     0.8         0.3
...                ...     ...      ...     ...        ...     ...         ...
8733  2023-12-30 21:00     2.2      0.1     NaN        NaN     0.4         NaN
8734  2023-12-30 22:00     2.2      NaN     NaN        NaN     0.3         NaN
8735  2023-12-30 23:00     2.3      NaN     NaN        NaN     0.2         NaN
8736  2023-12-31 00:00     2.5      1.9     NaN        NaN     0.2         NaN
8737  2023-12-31 01:00     2.4      NaN     NaN        NaN     0.1         NaN

[353 rows x 7 columns]

## 행궁동 적설량

In [4]:
sw_snowfall_1 = sw_weather[['일시','적설(cm)']]
# sw_snowfall_1['시간'] = sw_snowfall_1['일시'].astype(str).str[11:13].astype(int)
# sw_snowfall_1['날짜'] = sw_snowfall_1['일시'].astype(str).str[:11]
sw_snowfall_1

                    일시  적설(cm)
0     2023-01-01 00:00     NaN
1     2023-01-01 01:00     NaN
2     2023-01-01 02:00     NaN
3     2023-01-01 03:00     NaN
4     2023-01-01 04:00     NaN
...                ...     ...
8755  2023-12-31 19:00     NaN
8756  2023-12-31 20:00     NaN
8757  2023-12-31 21:00     NaN
8758  2023-12-31 22:00     NaN
8759  2023-12-31 23:00     NaN

[8760 rows x 2 columns]

In [40]:
sw_snowfall_1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8760 entries, 0 to 8759
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   일시      8760 non-null   object
 1   적설(cm)  353 non-null    float64
dtypes: float64(1), object(1)
memory usage: 137.0+ KB

In [5]:
hg_snowfall = pd.read_csv('c:/Users/Admin/AI/downloads/카드소비데이터 수원시/행궁동_1시간적설_20230101_20251031.csv')
hg_snowfall

,format: day,hour,forecast,value location:61_121 Start : 20230101
0,1,200.0,6.0,0.0
1,1,200.0,7.0,0.0
2,1,200.0,8.0,0.0
3,1,200.0,9.0,0.0
4,1,200.0,10.0,0.0
...,...,...,...,...
547933,31,2300.0,76.0,0.0
547934,31,2300.0,79.0,0.0
547935,31,2300.0,82.0,0.0
547936,31,2300.0,85.0,0.0
547937,31,2300.0,88.0,0.0

In [10]:
hg_snowfall[hg_snowfall['value  location:61_121 Start : 20230101 ']>0]

,format: day,hour,forecast,value location:61_121 Start : 20230101
162761,16,2000.0,9.0,1.4
162820,16,2300.0,6.0,1.4
176769,14,800.0,43.0,1.0
176770,14,800.0,44.0,1.0
178688,18,200.0,35.0,1.1
...,...,...,...,...
416791,17,500.0,11.0,1.2
416850,17,800.0,9.0,1.0
416851,17,800.0,10.0,1.8
416929,17,1100.0,6.0,1.0
416930,17,1100.0,7.0,1.8

## 행궁동 구름

In [28]:
hg_cloud = pd.read_csv('c:/Users/Admin/AI/downloads/카드소비데이터 수원시/행궁동_하늘상태_20230101_20251031.csv')
hg_cloud.drop('forecast', inplace=True, axis=1)
hg_cloud

        format: day    hour  value  location:61_121 Start : 20230101
0                 1   200.0                                       1.0
1                 1   200.0                                       1.0
2                 1   200.0                                       3.0
3                 1   200.0                                       3.0
4                 1   200.0                                       3.0
...             ...     ...                                       ...
548441           31  2300.0                                       1.0
548442           31  2300.0                                       1.0
548443           31  2300.0                                       1.0
548444           31  2300.0                                       1.0
548445           31  2300.0                                       1.0

[548446 rows x 3 columns]

In [29]:
hg_cloud['H'] = (hg_cloud['hour'] // 100).astype(int)
hg_cloud.drop('hour', axis=1, inplace=True)
hg_cloud

IntCastingNaNError: Cannot convert non-finite values (NA or inf) to integer

In [24]:
# hg_cloud.groupby([' format: day', 'hour'], as_index=False)['value  location:61_121 Start : 20230101 '].max()
hg_cloud.iloc[::50] # 2,5,8,11,14,17,20,23

        format: day    hour  value  location:61_121 Start : 20230101
0                 1   200.0                                       1.0
50                1   200.0                                       1.0
100               1   500.0                                       1.0
150               1   800.0                                       1.0
200               1  1100.0                                       1.0
...             ...     ...                                       ...
547200           31  1400.0                                       1.0
547250           31  1700.0                                       1.0
547300           31  2000.0                                       3.0
547350           31  2300.0                                       1.0
547400           31  2300.0                                       1.0

[10949 rows x 3 columns]

In [15]:
mask = hg_cloud[' format: day'].astype(str).str.contains('Start')
hg_cloud = hg_cloud[~mask].reset_index(drop=True)
days = pd.date_range('2023-01-01', '2025-10-31', freq='D')
full_dates = days.repeat(24) 
print(len(hg_cloud), len(full_dates))
# hg_cloud['date'] = full_dates.strftime('%Y%m%d')
# hg_cloud.drop(columns=[' format: day'], inplace=True)
# hg_cloud.rename(columns={'value  location:61_121 Start : 20230101 ': 'cloud'},inplace=True)

547412 24840

In [13]:
hg_cloud.columns

Index([' format: day', 'hour', 'value  location:61_121 Start : 20230101 '], dtype='object')

# 종합

In [19]:
sw_data = pd.read_csv('c:/Users/Admin/AI/downloads/카드소비데이터 수원시/SUWON_S_DATA_TABLE.csv')
sw_data = sw_data.sort_values(['TA_YMD','HOUR']).reset_index(drop=True)
sw_data_sum = sw_data.groupby(['TA_YMD','DONG', 'HOUR', 'DAY'], as_index=False).agg({
    'AGE': 'sum',    
    'AMT': 'sum',    
    'CNT': 'sum',   
    'UNIT': 'mean',  
    'TEMP': 'mean',   
    'RAIN': 'mean'   
})
sw_data_sum.drop(['AGE', 'UNIT'], inplace=True, axis=1)
sw_data_sum

          TA_YMD  DONG  HOUR  DAY      AMT  CNT   TEMP  RAIN
0       20230101   고등동     1    7    65063    7   2.10   0.0
1       20230101   고등동     2    7    14878    4  -0.20   0.0
2       20230101   고등동     3    7    77671   20  -2.25   0.0
3       20230101   고등동     4    7   452897   52  -3.20   0.0
4       20230101   고등동     5    7   972179   92  -4.10   0.0
...          ...   ...   ...  ...      ...  ...    ...   ...
101508  20251031  화서2동     6    5   886440  155  11.65   1.5
101509  20251031  화서2동     7    5  1319747  105  11.65   0.0
101510  20251031  화서2동     8    5  3662364  125  10.70   0.0
101511  20251031  화서2동     9    5  1999679   51   9.35   0.0
101512  20251031  화서2동    10    5    33534   11  12.00   0.0

[101513 rows x 8 columns]

In [17]:
sw_data_sum = sw_data_sum.sort_values(['TA_YMD', 'DONG', 'HOUR'])

          TA_YMD  DONG  HOUR  DAY      AMT  CNT          UNIT   TEMP  RAIN
0       20230101   고등동     1    7    65063    7  11650.000000   2.10   0.0
1       20230101   고등동     2    7    14878    4   3719.500000  -0.20   0.0
2       20230101   고등동     3    7    77671   20   3994.400000  -2.25   0.0
3       20230101   고등동     4    7   452897   52   8561.200000  -3.20   0.0
4       20230101   고등동     5    7   972179   92  10032.142857  -4.10   0.0
...          ...   ...   ...  ...      ...  ...           ...    ...   ...
101508  20251031  화서2동     6    5   886440  155   5864.250000  11.65   1.5
101509  20251031  화서2동     7    5  1319747  105  10592.666667  11.65   0.0
101510  20251031  화서2동     8    5  3662364  125  23087.666667  10.70   0.0
101511  20251031  화서2동     9    5  1999679   51  32272.600000   9.35   0.0
101512  20251031  화서2동    10    5    33534   11   3042.000000  12.00   0.0

[101513 rows x 9 columns]

In [22]:
sw_data_sum['UNIT'] = pd.to_numeric((sw_data_sum['AMT']/sw_data_sum['CNT']).round(),errors='coerce').fillna(0).astype('int64')
sw_data_sum = sw_data_sum[sw_data_sum['RAIN']>=0].reset_index(drop=True)
sw_data_sum = sw_data_sum[['TA_YMD','HOUR','DAY','DONG','AMT','CNT','UNIT','TEMP','RAIN']]
sw_data_sum

          TA_YMD  HOUR  DAY  DONG      AMT  CNT   UNIT   TEMP  RAIN
0       20230101     1    7   고등동    65063    7   9295   2.10   0.0
1       20230101     2    7   고등동    14878    4   3720  -0.20   0.0
2       20230101     3    7   고등동    77671   20   3884  -2.25   0.0
3       20230101     4    7   고등동   452897   52   8710  -3.20   0.0
4       20230101     5    7   고등동   972179   92  10567  -4.10   0.0
...          ...   ...  ...   ...      ...  ...    ...    ...   ...
101508  20251031     6    5  화서2동   886440  155   5719  11.65   1.5
101509  20251031     7    5  화서2동  1319747  105  12569  11.65   0.0
101510  20251031     8    5  화서2동  3662364  125  29299  10.70   0.0
101511  20251031     9    5  화서2동  1999679   51  39209   9.35   0.0
101512  20251031    10    5  화서2동    33534   11   3049  12.00   0.0

[101513 rows x 9 columns]

In [32]:
sw_data_sum.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 101513 entries, 0 to 101512
Data columns (total 9 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   TA_YMD  101513 non-null  int64
 1   HOUR    101513 non-null  int64
 2   DAY     101513 non-null  int64
 3   DONG    101513 non-null  object
 4   AMT     101513 non-null  int64
 5   CNT     101513 non-null  int64
 6   UNIT    101513 non-null  int64
 7   TEMP    101513 non-null  float64
 8   RAIN    101513 non-null  float64
dtypes: float64(2), int64(6), object(1)
memory usage: 7.0+ MB

# 기타 확인용

In [47]:
gg_cmt_23 = pd.read_csv('C:/Users/Admin/AI/downloads/카드소비데이터 수원시/경기도 발달 골목 상권 추정 매출 현황(2023년)(11차기준).csv', encoding='cp949')
gg_cmt_23 = gg_cmt_23[gg_cmt_23['산업분류코드명'].isin(['커피 전문점', '기타 비알코올 음료점업'])].reset_index(drop=True)
gg_cmt_23.drop(['기준연도','산업분류코드','산업분류코드명'], inplace=True, axis=1)
gg_cmt_23 = gg_cmt_23.groupby(['상권명'], as_index=False)[['매출금액','매출건수']].sum()
gg_cmt_23

            상권명        매출금액    매출건수
0         CGV김포   827128864   98352
1       CGV김포운양  1969702293  321436
2        CGV부천역  3419007036  452230
3        CGV북수원  3036520735  498896
4         CGV이천  2573249177  216985
...         ...         ...     ...
1591       흥안대로   545829050   86551
1592  흥안대로427번길  1560512602  249043
1593  흥안대로456번길   635357424  122186
1594  흥안대로517번길   310391976   18941
1595        희망로    74047348   11684

[1596 rows x 3 columns]

In [41]:
sw_cafe = pd.read_csv('C:/Users/Admin/AI/downloads/카드소비데이터 수원시/행정동 단위 상가업소 조회.csv', encoding='cp949')
sw_cafe = sw_cafe[sw_cafe['시군명']=='수원시 팔달구'].reset_index(drop=True)
sw_cafe = sw_cafe[sw_cafe['상권업종소분류명']=='카페'].reset_index(drop=True)
sw_cafe.drop(['상권업종대분류명','상권업종중분류명','상권업종소분류명','표준산업분류명','건물명','시군명','지점명','소재지지번주소','소재지도로명주소','소재지우편번호'], inplace=True, axis=1)
sw_cafe.columns = ['상권명', '위도', '경도']
sw_cafe

         상권명         위도          경도
0        하우짓  37.281385  127.006748
1       미르카페  37.274646  127.027505
2         부터  37.285163  127.011423
3        윤카페  37.286813  127.031183
4       커피가이  37.283458  127.019881
...      ...        ...         ...
1129     블루힙  37.263067  127.031938
1130  호이차동수원  37.262746  127.030116
1131     루시퍼  37.265097  127.026827
1132      윙고  37.266303  127.034309
1133     용다방  37.268584  127.000782

[1134 rows x 3 columns]

In [45]:
result = pd.merge(
    gg_cmt_23,
    sw_cafe,
    on='상권명',      
    how='inner')
result

Empty DataFrame
Columns: [상권명, 매출금액, 매출건수, 위도, 경도]
Index: []